backend/TransactionSign.Tests/LoadTests/results/20260415-123657/k6-output.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: C:\Users\Davit Gabrielyan\source\repos\TransactionSign\backend\TransactionSign.Tests\LoadTests\k6-workflow.js
        output: -

     scenarios: (100.00%) 2 scenarios, 11 max VUs, 30m5s max duration (incl. graceful stop):
              * monitor: 1 looping VUs for 30m0s (exec: monitorCompletion)
              * signers: 10 looping VUs for 30m0s (exec: signerFlow, gracefulStop: 5s)


running (00m01.0s), 11/11 VUs, 9 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m01.0s/30m0s
signers   [   0% ] 10 VUs  00m01.0s/30m0s

running (00m02.0s), 11/11 VUs, 20 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m02.0s/30m0s
signers   [   0% ] 10 VUs  00m02.0s/30m0s
time="2026-04-15T12:36:59+04:00" level=info msg="{\"level\":\"info\",\"action\":\"complete\",\"message\":\"All transactions signed\",\"ts\":\"2026-04-15T08:36:59.387Z\"}" source=console

running (00m03.0s), 11/11 VUs, 32 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m03.0s/30m0s
signers   [   0% ] 10 VUs  00m03.0s/30m0s

running (00m04.0s), 11/11 VUs, 43 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m04.0s/30m0s
signers   [   0% ] 10 VUs  00m04.0s/30m0s

running (00m05.0s), 11/11 VUs, 57 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m05.0s/30m0s
signers   [   0% ] 10 VUs  00m05.0s/30m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.10' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 74      14.726683/s
    checks_succeeded...: 100.00% 74 out of 74
    checks_failed......: 0.00%   0 out of 74

    ✓ pending 200

    HTTP
    http_req_duration..............: avg=3.08ms   min=746.1µs  med=2.85ms   max=8.67ms p(90)=4.45ms   p(95)=4.79ms  
      { expected_response:true }...: avg=3.08ms   min=746.1µs  med=2.85ms   max=8.67ms p(90)=4.45ms   p(95)=4.79ms  
    http_req_failed................: 0.00%  0 out of 74
    http_reqs......................: 74     14.726683/s

    EXECUTION
    iteration_duration.............: avg=878.69ms min=607.35ms med=816.21ms max=5.02s  p(90)=962.58ms p(95)=995.61ms
    iterations.....................: 59     11.741544/s
    vus............................: 11     min=11      max=11
    vus_max........................: 11     min=11      max=11

    NETWORK
    data_received..................: 12 kB  2.4 kB/s
    data_sent......................: 8.0 kB 1.6 kB/s



running (00m05.0s), 00/11 VUs, 58 complete and 11 interrupted iterations
monitor ✗ [   0% ] 1 VUs   00m05.0s/30m0s
signers ✗ [   0% ] 10 VUs  00m05.0s/30m0s
time="2026-04-15T12:37:02+04:00" level=error msg="test aborted: All transactions signed - test complete at monitorCompletion (file:///C:/Users/Davit%20Gabrielyan/source/repos/TransactionSign/backend/TransactionSign.Tests/LoadTests/k6-workflow.js:177:24(88))"